# Customers who never order

### Loading the data

In [1]:
customers = {"headers": ["id", "name"], "values": [[1, "Joe"], [2, "Henry"], [3, "Sam"], [4, "Max"]]}

In [2]:
orders = {"headers": ["id", "customerId"], "values": [[1, 3], [2, 1]]}

In [3]:
import sqlite3

conn = sqlite3.connect('crm.db')

import pandas as pd
def build_dataframe(data):
    columns = data['headers']
    values = data['values']
    df = pd.DataFrame(values)
    df.columns = columns
    return df

In [4]:
customers_df = build_dataframe(customers)
customers_df

   id   name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

In [5]:
orders_df = build_dataframe(orders)
orders_df

   id  customerId
0   1           3
1   2           1

In [9]:
customers_df.to_sql('customers', conn, if_exists = 'replace', index = False)

4

In [10]:
orders_df.to_sql('orders', conn, if_exists = 'replace', index = False)

2

In [14]:
pd.read_sql('select * from customers', conn)

   id   name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

In [15]:
pd.read_sql('select * from orders', conn)

   id  customerId
0   1           3
1   2           1

### Question

Write an SQL query to report all customers who never order anything.

Return the result table in any order.

The query result format is in the following example.

> Answer:

```
+-----------+
| Customers |
+-----------+
| Henry     |
| Max       |
+-----------+
```